{
  "data": [
    {
      "tag": "Earthquake",
      "patterns": [
        "I am stuck in an earthquake, please help.",
        "Objects are falling around me, I need assistance.",
        "The ground is shaking and I am having difficulty standing.",
        "Everything is shaking, I am scared and need help.",
        "The ground is moving and I don't know what to do.",
        "I can see cracks developing in the ground, it's getting worse.",
        "The ground is rupturing and I am having trouble finding a safe place.",
        "My bed is shaking and I am unable to sleep.",
        "The buildings around me are swinging, I need help getting out of the area.",    
        "I'm trapped and need help getting out of the building",
        "I am injured and need medical assistance",
        "I am stuck under debris and need help getting out",
        "I am in a car and it's shaking and I am unable to move",
        "I am stuck in an elevator and it's shaking",
        "I am stuck in a subway and it's shaking and I need help getting out of the area.",
        "I am stuck in a subway and it's shaking and I am unable to move",
        "I am in a mall and it's shaking and I am unable to move",
        "I am stuck in a skyscraper and it's shaking",
        "I am in a school and it's shaking, and I am unable to move",
        "I am at work and the building is shaking, I need help getting to safety",
        "I am in a hospital and the power has gone out, I need assistance",
        "I am on a bridge and it's shaking, I need help getting off",
        "I am in a park and the ground is cracking beneath me, I need help",
        "I am in an earthquake", 
        "objects are falling", 
        "ground is shaking",
        "Everything is shaking",
        "Ground is moving",
        "The ground is developing cracks",
        "ground is rupturing",
        "Home is damaged",
        "My bed is shaking",
        "The buildings are swinging",
        "Help! I'm trapped in an earthquake!",
"The ground is shaking, I can't move!",
"I'm stuck in a collapsing building!",
"I'm trapped in a crumbling structure!",
"I need help, I'm stuck in a dangerous situation!",
"I'm surrounded by rubble and can't move!",
"I'm caught in the middle of a devastating earthquake!",
"I'm stuck in a subway station in danger of collapse!",
"I'm trapped in an airport in danger of collapse!",
"I'm stuck in a train station in danger of collapse!",
"I'm trapped in a bus station in danger of collapse!",
"I'm stuck in a parking garage in danger of collapse!",
"I'm trapped in a parking lot in danger of collapse!",
"I'm stuck in a factory in danger of collapse!",
"I'm trapped in a warehouse in danger of collapse!",
"I'm stuck in a mall in danger of collapse!",
"I'm trapped in a hotel in danger of collapse!",
"I'm stuck in a home in danger of collapse!",
"I'm trapped in an apartment in danger of collapse!",
"The earthquake is severe, I can't move!",
"I'm stuck in an office in danger of collapse!",
"I'm trapped in a damaged train!",
"I'm stuck in a damaged tunnel!",
"I'm trapped in a damaged camping tent!",
"I'm stuck in a damaged barn!",
"I'm trapped in a damaged cottage!",
"I'm stuck in a damaged underground station!",
"I'm trapped in a damaged boat!",
"I'm stuck in a damaged cabin!",
"I'm stuck in a damaged shop!",
"I'm trapped in a damaged restaurant!",
"I'm stuck in a damaged theater!",
"I'm trapped in a damaged concert hall!",
"I'm stuck in a damaged cinema!",
"I'm trapped in a damaged church!",
"I'm stuck in a damaged mosque!",
"I'm trapped in a damaged temple!",
"I'm stuck in a damaged synagogue!",
"I'm trapped in a damaged school!",
"I'm stuck in a damaged hospital!",
"I'm stuck in a damaged military base!",
"I'm trapped in a damaged hotel!",
"I'm stuck in a damaged dormitory!",
"I'm trapped in a damaged gym!",
"I'm stuck in a damaged spa!",
"I'm trapped in a damaged sauna!",
"I'm stuck in a damaged swimming pool!",
"I'm trapped in a damaged golf club!",
"I'm stuck in a damaged library!",
"I'm trapped in a damaged museum!",
"I'm stuck in a damaged zoo!",
"I'm trapped in a damaged aquarium!",
"I'm stuck in a damaged theme park!",
"I'm trapped in a damaged observatory!",
"I'm stuck in a damaged laboratory!",
"I'm trapped in a damaged research facility!",
"I'm stuck in a damaged power plant!",
"I'm trapped in a damaged nuclear facility!",
"I'm trapped in a dangerous zone!",
"I'm stuck in a falling structure!",
"I'm trapped in a crumbling infrastructure!",
"I'm stuck in a dangerous transportation hub!",
"I'm trapped in a shaking building!",
"I'm stuck in a crumbling residential area!",
"I'm trapped in a collapsing commercial area!",
"I'm stuck in a hazardous industrial area!",
"I'm trapped in a shaking public area!",
"I'm stuck in a unstable structure!",
"I'm trapped in a shaking infrastructure!",
"I'm stuck in a collapsing transportation hub!",
"I'm trapped in a crumbling public area!"
        ],
      "responses": [
        "Please consider the following measures- \n 1. Stay calm and don't panic. \n 2. If you are indoors: \n Take cover under a sturdy piece of furniture or against an interior wall. \n Stay away from windows, mirrors, and other objects that can break.\n Do not use elevators. \n 3. If you are outdoors: \n Move to an open area away from buildings, power lines, and other potential hazards.\n Avoid bridges, overpasses, and other structures that can collapse.\n 4. If you are in a vehicle:\n Pull over to a safe location and stop the car.\n Stay inside the vehicle until the shaking stops.\n 5. If you are at work or school:\n Follow the evacuation plan and procedures established by the building management. \n Do not use elevators.\n Follow the instructions of emergency personnel."
      ]
    },
    {
      "tag": "Fire",
      "patterns": [
        "I am stuck in fire",
        "Fire Fire Fire",
        "Flames all around me",
        "Fire all around me",
        "Fire surrounds me",
        "Fire in building",
        "i am caught in fire",
        "Burning my house",
        "high flames burning my car",
        "Smoke is choking me",
        "It's urgent I need to call the [fire department], please",
            "We need the [fire brigade], please",
            "I have to call the [firefighters], please",
            "A fire has spread in the room, I have to call the [firefighters], it's urgent!!!",
            "The fire alarm has been triggered, we need to contact the [fire department], we need an help!!!",
            "I have to call the [fire chief], please",
            "I need to alert the [firefighters], fire doors are open",
            "I need to call [firefighters], fire has spread into the building, is not a fire drill",
            "I have to call the [fire engine], please",
            "Fire is spread into the rooms, we need a fire escape to exit from the building, I need to reach the [fire department]!!!",
            "I have to call [firefighters] and use fire exit!!!",
            "We need a fire extinguisher to stop the fire, I need to call the [fire department], please",
            "Pay attention to the fire hazard, I have to call the [fire department]!!!",
            "I need help of the [fire brigade] for the use of fire hydrant",
            "The house is burned, I have to phone the [fire department]",
            "A fire lighter has exploded and the room has burned, I need help from the [fire department]",
            "I have to call the next [fire protection] district, please",
            "I need help of the [fire authority], please",
            "I need to call the [fire and rescue service], please",
            "Let's call the [fire station], please",
            "Let's call volunteer [firefighters], we need an urgent help!!!",
            "We need help, I have fire in my house, I need to contact the [fire brigade]",
            "My house is burning,  please I need to contact the [firefighters]",
            "Please I need to contact the [fire and rescue service]",
            "Neighbour's house is burning, I need to contact [fire department]",
            "I have to call the [fireman]",
            "Please let's contact the [firefighters department]",
            "We need the service of the [firefighters] here",
            "The fire alarm is not working let's contact the [firefighters]",
            "Please I have to call the [fire patrol] immediately",
            "I need to phone the [firefighters]",
            "I have to phone the [firefighters station]",
            "We cannot stop the fire, we need to call the [fire brigade]",
            "Fire is everywhere, I have to call the [fire department]",
            "Fire is unstoppable, I have to call the close [fire station]",
            "Fire is developing very fast, I have to call [firemen]",
            "We have emergency at house, it burning, I have to contact the [fire protection]",
            "Fire! Fire! I can't get out!",
"I'm stuck in a raging inferno!",
"I'm surrounded by flames and can't move!",
"The fire is blocking my exit!",
"I'm trapped in a fiery nightmare!",
"I can't escape the blaze!",
"The heat is overwhelming and I can't move!",
"I'm caught in the middle of a raging firestorm!",
"I need help! I'm stuck in a burning car!",
"I'm trapped on the top floor of a burning skyscraper!",
"I'm surrounded by smoke and flames!",
"I'm stuck in a burning warehouse!",
"I'm trapped in a burning forest!",
"I'm stuck in a burning oil rig!",
"I'm trapped in a burning plane!",
"I'm stuck in a burning ship!",
"I'm trapped in a burning factory!",
"I'm stuck in a burning mall!",
"I'm trapped in a burning hotel!",
"I'm stuck in a burning home",
"I'm trapped in a burning apartment",
"The fire is spreading fast and I can't move",
"I'm stuck in a burning office",
"I'm trapped in a burning train",
"I'm stuck in a burning tunnel",
"I'm trapped in a burning camping tent",
"I'm stuck in a burning barn",
"I'm trapped in a burning cottage",
"I'm stuck in a burning underground station",
"I'm trapped in a burning boat",
"I'm stuck in a burning cabin",
"I'm trapped in a burning mine",
"I'm stuck in a burning shop",
"I'm trapped in a burning restaurant",
"I'm stuck in a burning theater",
"I'm trapped in a burning concert hall",
"I'm stuck in a burning cinema",
"I'm stuck in a burning church",
"I'm trapped in a burning mosque",
"I'm stuck in a burning temple",
"I'm trapped in a burning synagogue",
"I'm stuck in a burning school",
"I'm trapped in a burning hospital",
"I'm stuck in a burning prison",
"I'm stuck in a burning military base",
"I'm trapped in a burning hotel",
"I'm stuck in a burning dormitory",
"I'm trapped in a burning gym",
"I'm stuck in a burning spa",
"I'm trapped in a burning sauna",
"I'm stuck in a burning swimming pool",
"I'm trapped in a burning golf club",
"I'm stuck in a burning library",
"I'm trapped in a burning museum",
"I'm stuck in a burning zoo",
"I'm trapped in a burning aquarium",
"I'm stuck in a burning theme park",
"I'm trapped in a burning observatory",
"I'm trapped in a burning research facility",

    "I'm stuck in a burning power plant",
    "I'm trapped in a burning nuclear facility",
    "I'm stuck in a burning oil refinery",
    "I'm trapped in a burning chemical plant",
    "I'm stuck in a burning gas station",
    "I'm trapped in a burning airport",
    "I'm stuck in a burning train station",
    "I'm trapped in a burning bus station",
    "I'm stuck in a burning subway station",
    "I'm trapped in a burning parking garage",
    "I'm stuck in a burning parking lot",
    "I'm trapped in a burning storage unit",
    "I'm stuck in a burning RV park",
    "I'm trapped in a burning campsite",
    "I'm stuck in a burning marina",
    "I'm trapped in a burning dock",
    "I'm stuck in a burning beach house",
    "I'm trapped in a burning mountain cabin",
    "I'm stuck in a burning ski chalet",
    "I'm trapped in a burning ice-fishing shack",
    "I'm stuck in a burning hunting cabin",
    "I'm trapped in a burning vacation home",
    "I'm stuck in a burning vacation rental",
    "I'm trapped in a burning hostel",
    "I'm stuck in a burning bed and breakfast",
    "I'm trapped in a burning hotel room",
    "I'm stuck in a burning beach shack",
    "I'm trapped in a burning island bungalow",
    "I'm stuck in a burning treehouse",
    "I'm trapped in a burning yurt",
    "I'm stuck in a burning tipi",
    "I'm trapped in a burning igloo",
    "I'm stuck in a burning tent",
    "I'm trapped in a burning teepee",
    "I'm stuck in a burning straw bale house",
    "I'm trapped in a burning shipping container",
    "I'm stuck in a burning RV",
    "I'm trapped in a burning boat",
    "I'm stuck in a burning hot air balloon"
      ],
      "responses": [
        "Please consider the following measures- \n 1. Stay calm and do not panic \n 2. Sound the fire alarm and shout to alert others in the house \n 3. Call the local fire department immediately by dialing 101 or the emergency number in your area. Provide them with your address and details of the fire. \n 4. Close all doors and windows to contain the fire and prevent it from spreading. \n 5. Evacuate the house immediately and gather at a safe location outside.\n"
      ]
    },
    {
      "tag": "Flood",
      "patterns": [
        "Lots of water around me", 
        "neighbourhood is flooded", 
        "roads submerged under water",
        "flat is submerged under water",
        "water all around me",
        "The lanes are choked with water",
        "People are drowning outside",
        "heavy rainfall damaged houses",
        "lots of standstill water",
        "water filling in room",
        "I am surrounded by water, I need help getting to safety",
        "My neighborhood is flooded and I can't leave my house",
        "The roads are submerged under water and I am unable to drive",
        "My house is submerged under water, I need help",
        "Water is all around me, I am stranded and need assistance",
        "The lanes in my area are choked with water, I can't leave",
        "I can see people drowning outside, I need help",
        "Heavy rainfall has damaged many houses in my area, I need assistance",
        "There is a lot of standing water around me, I need help getting to higher ground",
        "Water is filling up my room, I need help getting out",
        "I am in a boat and it's floating away, I need help",
        "I am in a low-lying area and the water is rising quickly, I need help",
        "I am in a car and it's stuck in the flood water, I need assistance",
        "I am on a bridge and it's flooding, I need help getting off",
        "I am in a basement and the water is coming in, I need help",
        "I am in a hotel and it's flooding, I need help getting out",
        "I am in a campground and it's flooding, I need help",
        "I am on a farm and the water is damaging the crops, I need help",
        "I am in a shopping mall and it's flooding, I need help getting out",
        "I am in a factory and the water is damaging the machinery, I need help",
        "Help! I'm trapped in a flood!",
        "I'm stuck in a submerged building!",
        "I'm surrounded by rising water and can't move!",
        "I need help, I'm stuck in a dangerous flood zone!",
        "I'm trapped in a flooding area!",
        "I'm caught in the middle of a devastating flood!",
        "I'm stuck in a flooded street!",
        "I'm trapped in a flooded subway station!",
        "I'm stuck in a flooded airport!",
        "I'm trapped in a flooded train station!",
        "I'm stuck in a flooded bus station!",
        "I'm trapped in a flooded parking garage!",
        "I'm stuck in a flooded parking lot!",
        "I'm trapped in a flooded factory!",
        "I'm stuck in a flooded warehouse!",
        "I'm trapped in a flooded mall!",
        "I'm stuck in a flooded hotel!",
        "I'm trapped in a flooded home!",
        "I'm stuck in a flooded apartment!",
        "The flood is severe, I can't move!",
        "I'm stuck in a flooded office!",
        "I'm trapped in a flooded train",
        "I'm stuck in a flooded tunnel",
        "I'm trapped in a flooded campsite",
        "I'm stuck in a flooded marina",
        "I'm trapped in a flooded dock",
        "I'm stuck in a flooded beach house",
        "I'm trapped in a flooded mountain cabin",
        "I'm stuck in a flooded ski chalet",
        "I'm trapped in a flooded island bungalow",
        "I'm stuck in a flooded vacation home",
        "I'm trapped in a flooded vacation rental",
        "I'm stuck in a flooded hostel",
        "I'm trapped in a flooded bed",
        "I'm stuck in a flooded hotel room",
        "I'm trapped in a flooded beach shack",
        "I'm stuck in a flooded treehouse",
        "I'm trapped in a flooded RV park",
        "I'm stuck in a flooded hunting cabin",
        "I'm trapped in a flooded fishing cabin",
        "I'm stuck in a flooded island cottage",
        "I'm trapped in a flooded riverfront property",
        "I'm stuck in a flooded lakeside property",
        "I'm trapped in a flooded coastal property",
        "I'm stuck in a flooded low lying area",
        "I'm trapped in a flooded flood plain",
        "I'm stuck in a flooded delta",
        "I'm trapped in a flooded estuary",
        "I'm stuck in a flooded swamp",
        "I'm trapped in a flooded marsh",
        "I'm trapped in a rising water!",
"I'm stuck in a submerged building!",
"I'm surrounded by floodwaters and can't move!",
"I'm trapped in a transportation hub with water rising!",
"I'm stuck in an airport with water rising!",
"I'm trapped in a train station with water rising!",
"I'm stuck in a bus station with water rising!",
"I'm trapped in a parking garage with water rising!",
"I'm stuck in a parking lot with water rising!",
"I'm trapped in a factory with water rising!",
"I'm stuck in a warehouse with water rising!",
"I'm trapped in a mall with water rising!",
"I'm stuck in a hotel with water rising!",
"I'm trapped in a home with water rising!",
"I'm stuck in an apartment with water rising!",
"The flood is severe, I can't move!",
"I'm stuck in an office with water rising!",
"I'm trapped in a train with water rising",
"I'm stuck in a tunnel with water rising",
"I'm trapped in a campsite with water rising",
"I'm stuck in a marina with water rising",
"I'm trapped in a dock with water rising",
"I'm stuck in a beach house with water rising"
        ],
      "responses": [
        "Please consider the following measures- \n 1. Stay informed and stay updated about the flood warning and evacuation orders issued by the local authorities, and follow their instructions.\n 2. If you are in a flood-prone area, be prepared to evacuate immediately.\n 3. If you are at home, move to the highest point in your home.\n 4. Turn off all electricity, gas, and water supplies if instructed to do so by the authorities.\n 5. Do not try to move too much water by yourself. Wait for professional help. \n"
        ]
    }
  ]
}